jurgen-kluft/rlcd/source/lib_display/cpp/databus/databus_ESP32PAR8Q.cpp
#include "lib_display/databus/databus_ESP32PAR8Q.h"

#if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 || CONFIG_IDF_TARGET_ESP32P4 || \
                       CONFIG_IDF_TARGET_ESP32C5)

Arduino_ESP32PAR8Q::Arduino_ESP32PAR8Q(int8_t dc, int8_t cs, int8_t wr, int8_t rd, int8_t d0, int8_t d1, int8_t d2, int8_t d3, int8_t d4, int8_t d5, int8_t d6, int8_t d7)
    : _dc(dc)
    , _cs(cs)
    , _wr(wr)
    , _rd(rd)
    , _d0(d0)
    , _d1(d1)
    , _d2(d2)
    , _d3(d3)
    , _d4(d4)
    , _d5(d5)
    , _d6(d6)
    , _d7(d7)
{
}

bool Arduino_ESP32PAR8Q::begin(int32_t, int8_t)
{
    pinMode(_dc, OUTPUT);
    digitalWrite(_dc, HIGH);  // Data mode
    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    if (_dc >= 32)
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else
    {
        _dcPinMask = digitalPinToBitMask(_dc);
        _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    _dcPinMask = digitalPinToBitMask(_dc);
    _dcPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
    _dcPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    #endif

    if (_cs != GFX_NOT_DEFINED)
    {
        pinMode(_cs, OUTPUT);
        digitalWrite(_cs, HIGH);  // disable chip select
    }
    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    if (_cs >= 32)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    if (_cs != GFX_NOT_DEFINED)
    {
        _csPinMask = digitalPinToBitMask(_cs);
        _csPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _csPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #endif

    pinMode(_wr, OUTPUT);
    digitalWrite(_wr, HIGH);  // Set write strobe high (inactive)
    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    if (_wr >= 32)
    {
        _wrPinMask = digitalPinToBitMask(_wr);
        _wrPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _wrPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else
    {
        _wrPinMask = digitalPinToBitMask(_wr);
        _wrPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _wrPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    _wrPinMask = digitalPinToBitMask(_wr);
    _wrPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
    _wrPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    #endif

    if (_rd != GFX_NOT_DEFINED)
    {
        pinMode(_rd, OUTPUT);
        digitalWrite(_rd, HIGH);
    }

    // TODO: check pin range 0-31
    pinMode(_d0, OUTPUT);
    pinMode(_d1, OUTPUT);
    pinMode(_d2, OUTPUT);
    pinMode(_d3, OUTPUT);
    pinMode(_d4, OUTPUT);
    pinMode(_d5, OUTPUT);
    pinMode(_d6, OUTPUT);
    pinMode(_d7, OUTPUT);

    #if (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
    if (_d0 >= 32)
    {
        _dataPortSet = (PORTreg_t)GPIO_OUT1_W1TS_REG;
        _dataPortClr = (PORTreg_t)GPIO_OUT1_W1TC_REG;
    }
    else
    {
        _dataPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
        _dataPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    }
    #else
    _dataPortSet = (PORTreg_t)GPIO_OUT_W1TS_REG;
    _dataPortClr = (PORTreg_t)GPIO_OUT_W1TC_REG;
    #endif

    // INIT 8-bit mask
    _dataClrMask = digitalPinToBitMask(_d0) | digitalPinToBitMask(_d1) | digitalPinToBitMask(_d2) | digitalPinToBitMask(_d3) | digitalPinToBitMask(_d4) | digitalPinToBitMask(_d5) | digitalPinToBitMask(_d6) | digitalPinToBitMask(_d7);

    for (int32_t c = 0; c < 256; c++)
    {
        _xset_mask[c] = 0;
        if (c & 0x01)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d0);
        }
        if (c & 0x02)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d1);
        }
        if (c & 0x04)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d2);
        }
        if (c & 0x08)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d3);
        }
        if (c & 0x10)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d4);
        }
        if (c & 0x20)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d5);
        }
        if (c & 0x40)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d6);
        }
        if (c & 0x80)
        {
            _xset_mask[c] |= digitalPinToBitMask(_d7);
        }
    }
    *_dataPortClr = _dataClrMask;

    return true;
}

void Arduino_ESP32PAR8Q::beginWrite()
{
    DC_HIGH();
    CS_LOW();
}

void Arduino_ESP32PAR8Q::endWrite() { CS_HIGH(); }

void Arduino_ESP32PAR8Q::writeCommand(uint8_t c)
{
    DC_LOW();

    WRITE(c);

    DC_HIGH();
}

void Arduino_ESP32PAR8Q::writeCommand16(uint16_t c)
{
    DC_LOW();

    _data16.value = c;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);

    DC_HIGH();
}

void Arduino_ESP32PAR8Q::writeCommandBytes(uint8_t *data, uint32_t len)
{
    DC_LOW();

    while (len--)
    {
        WRITE(*data++);
    }

    DC_HIGH();
}

void Arduino_ESP32PAR8Q::write(uint8_t d) { WRITE(d); }

void Arduino_ESP32PAR8Q::write16(uint16_t d)
{
    _data16.value = d;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);
}

void Arduino_ESP32PAR8Q::writeRepeat(uint16_t p, uint32_t len)
{
    _data16.value = p;
    if (_data16.msb == _data16.lsb)
    {
        uint32_t setMask = _xset_mask[_data16.msb];
        *_dataPortClr    = _dataClrMask;
        *_dataPortSet    = setMask;
        while (len--)
        {
            *_wrPortClr = _wrPinMask;
            *_wrPortSet = _wrPinMask;
            *_wrPortClr = _wrPinMask;
            *_wrPortSet = _wrPinMask;
        }
    }
    else
    {
        uint32_t hiMask = _xset_mask[_data16.msb];
        uint32_t loMask = _xset_mask[_data16.lsb];
        while (len--)
        {
            *_dataPortClr = _dataClrMask;
            *_dataPortSet = hiMask;
            *_wrPortClr   = _wrPinMask;
            *_wrPortSet   = _wrPinMask;

            *_dataPortClr = _dataClrMask;
            *_dataPortSet = loMask;
            *_wrPortClr   = _wrPinMask;
            *_wrPortSet   = _wrPinMask;
        }
    }
}

void Arduino_ESP32PAR8Q::writePixels(uint16_t *data, uint32_t len)
{
    while (len--)
    {
        _data16.value = *data++;
        WRITE(_data16.msb);
        WRITE(_data16.lsb);
    }
}

void Arduino_ESP32PAR8Q::writeC8D8(uint8_t c, uint8_t d)
{
    DC_LOW();

    WRITE(c);

    DC_HIGH();

    WRITE(d);
}

void Arduino_ESP32PAR8Q::writeC8D16(uint8_t c, uint16_t d)
{
    DC_LOW();

    WRITE(c);

    DC_HIGH();

    _data16.value = d;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);
}

void Arduino_ESP32PAR8Q::writeC8D16D16(uint8_t c, uint16_t d1, uint16_t d2)
{
    DC_LOW();

    WRITE(c);

    DC_HIGH();

    _data16.value = d1;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);

    _data16.value = d2;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);
}

void Arduino_ESP32PAR8Q::writeC8D16D16Split(uint8_t c, uint16_t d1, uint16_t d2)
{
    DC_LOW();

    WRITE(c);

    DC_HIGH();

    _data16.value = d1;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);

    _data16.value = d2;
    WRITE(_data16.msb);
    WRITE(_data16.lsb);
}

void Arduino_ESP32PAR8Q::writeBytes(uint8_t *data, uint32_t len)
{
    while (len--)
    {
        WRITE(*data++);
    }
}

void Arduino_ESP32PAR8Q::writeIndexedPixels(uint8_t *data, uint16_t *idx, uint32_t len)
{
    while (len--)
    {
        _data16.value = idx[*data++];
        WRITE(_data16.msb);
        WRITE(_data16.lsb);
    }
}

void Arduino_ESP32PAR8Q::writeIndexedPixelsDouble(uint8_t *data, uint16_t *idx, uint32_t len)
{
    while (len--)
    {
        _data16.value = idx[*data++];
        WRITE(_data16.msb);
        WRITE(_data16.lsb);
        WRITE(_data16.msb);
        WRITE(_data16.lsb);
    }
}

GFX_INLINE void Arduino_ESP32PAR8Q::WRITE(uint8_t d)
{
    uint32_t setMask = _xset_mask[d];
    *_dataPortClr    = _dataClrMask;
    *_dataPortSet    = setMask;
    *_wrPortClr      = _wrPinMask;
    *_wrPortSet      = _wrPinMask;
}

/******** low level bit twiddling **********/

GFX_INLINE void Arduino_ESP32PAR8Q::DC_HIGH(void) { *_dcPortSet = _dcPinMask; }

GFX_INLINE void Arduino_ESP32PAR8Q::DC_LOW(void) { *_dcPortClr = _dcPinMask; }

GFX_INLINE void Arduino_ESP32PAR8Q::CS_HIGH(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortSet = _csPinMask;
    }
}

GFX_INLINE void Arduino_ESP32PAR8Q::CS_LOW(void)
{
    if (_cs != GFX_NOT_DEFINED)
    {
        *_csPortClr = _csPinMask;
    }
}

#endif  // #if defined(ESP32) && (CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C2 || CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32H2 ||
        // CONFIG_IDF_TARGET_ESP32P4 || CONFIG_IDF_TARGET_ESP32C5)
